results/yugabyte-kubernetes-3-node-1-ebs-replica.txt
====== PING_INLINE ======
  100000 requests completed in 6.10 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

16.79% <= 1 milliseconds
66.82% <= 2 milliseconds
89.21% <= 3 milliseconds
94.89% <= 4 milliseconds
97.12% <= 5 milliseconds
98.10% <= 6 milliseconds
98.87% <= 7 milliseconds
99.28% <= 8 milliseconds
99.48% <= 9 milliseconds
99.60% <= 10 milliseconds
99.70% <= 11 milliseconds
99.73% <= 12 milliseconds
99.77% <= 13 milliseconds
99.80% <= 14 milliseconds
99.85% <= 15 milliseconds
99.87% <= 16 milliseconds
99.87% <= 17 milliseconds
99.88% <= 18 milliseconds
99.90% <= 19 milliseconds
99.93% <= 20 milliseconds
99.93% <= 21 milliseconds
99.93% <= 22 milliseconds
99.94% <= 23 milliseconds
99.94% <= 24 milliseconds
99.94% <= 32 milliseconds
99.95% <= 33 milliseconds
99.95% <= 34 milliseconds
99.95% <= 35 milliseconds
99.95% <= 37 milliseconds
99.96% <= 38 milliseconds
99.99% <= 39 milliseconds
100.00% <= 41 milliseconds
100.00% <= 41 milliseconds
16,396.13 requests per second

====== PING_BULK ======
  100000 requests completed in 6.50 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

14.40% <= 1 milliseconds
61.45% <= 2 milliseconds
86.30% <= 3 milliseconds
93.15% <= 4 milliseconds
96.12% <= 5 milliseconds
97.60% <= 6 milliseconds
98.54% <= 7 milliseconds
99.06% <= 8 milliseconds
99.37% <= 9 milliseconds
99.54% <= 10 milliseconds
99.67% <= 11 milliseconds
99.75% <= 12 milliseconds
99.87% <= 13 milliseconds
99.90% <= 14 milliseconds
99.93% <= 15 milliseconds
99.96% <= 16 milliseconds
99.96% <= 18 milliseconds
99.97% <= 19 milliseconds
99.98% <= 28 milliseconds
99.98% <= 29 milliseconds
99.99% <= 42 milliseconds
99.99% <= 47 milliseconds
99.99% <= 48 milliseconds
100.00% <= 48 milliseconds
15,386.98 requests per second

====== SET ======
  100000 requests completed in 112.77 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.02% <= 3 milliseconds
0.07% <= 4 milliseconds
0.14% <= 5 milliseconds
0.20% <= 6 milliseconds
0.24% <= 7 milliseconds
0.25% <= 8 milliseconds
0.27% <= 9 milliseconds
0.27% <= 10 milliseconds
0.28% <= 11 milliseconds
0.29% <= 12 milliseconds
0.30% <= 13 milliseconds
0.30% <= 14 milliseconds
0.30% <= 15 milliseconds
0.31% <= 16 milliseconds
0.31% <= 17 milliseconds
0.31% <= 18 milliseconds
0.31% <= 19 milliseconds
0.32% <= 20 milliseconds
0.32% <= 21 milliseconds
0.32% <= 22 milliseconds
0.33% <= 23 milliseconds
0.33% <= 24 milliseconds
0.34% <= 25 milliseconds
0.34% <= 27 milliseconds
0.34% <= 28 milliseconds
0.35% <= 29 milliseconds
0.35% <= 30 milliseconds
0.35% <= 31 milliseconds
0.36% <= 32 milliseconds
0.36% <= 33 milliseconds
0.36% <= 34 milliseconds
0.37% <= 35 milliseconds
0.37% <= 36 milliseconds
0.37% <= 37 milliseconds
0.38% <= 38 milliseconds
0.38% <= 39 milliseconds
0.38% <= 40 milliseconds
0.39% <= 41 milliseconds
0.39% <= 42 milliseconds
0.40% <= 43 milliseconds
0.41% <= 44 milliseconds
0.44% <= 45 milliseconds
0.58% <= 46 milliseconds
1.28% <= 47 milliseconds
3.34% <= 48 milliseconds
7.17% <= 49 milliseconds
13.10% <= 50 milliseconds
21.01% <= 51 milliseconds
29.67% <= 52 milliseconds
38.43% <= 53 milliseconds
46.90% <= 54 milliseconds
54.96% <= 55 milliseconds
62.01% <= 56 milliseconds
67.80% <= 57 milliseconds
72.58% <= 58 milliseconds
76.40% <= 59 milliseconds
79.58% <= 60 milliseconds
82.31% <= 61 milliseconds
84.58% <= 62 milliseconds
86.27% <= 63 milliseconds
87.82% <= 64 milliseconds
89.15% <= 65 milliseconds
90.35% <= 66 milliseconds
91.35% <= 67 milliseconds
92.22% <= 68 milliseconds
93.05% <= 69 milliseconds
93.77% <= 70 milliseconds
94.43% <= 71 milliseconds
95.07% <= 72 milliseconds
95.65% <= 73 milliseconds
96.15% <= 74 milliseconds
96.61% <= 75 milliseconds
96.96% <= 76 milliseconds
97.27% <= 77 milliseconds
97.50% <= 78 milliseconds
97.73% <= 79 milliseconds
97.95% <= 80 milliseconds
98.12% <= 81 milliseconds
98.28% <= 82 milliseconds
98.40% <= 83 milliseconds
98.49% <= 84 milliseconds
98.58% <= 85 milliseconds
98.64% <= 86 milliseconds
98.71% <= 87 milliseconds
98.78% <= 88 milliseconds
98.83% <= 89 milliseconds
98.87% <= 90 milliseconds
98.93% <= 91 milliseconds
98.98% <= 92 milliseconds
99.05% <= 93 milliseconds
99.10% <= 94 milliseconds
99.14% <= 95 milliseconds
99.19% <= 96 milliseconds
99.24% <= 97 milliseconds
99.27% <= 98 milliseconds
99.31% <= 99 milliseconds
99.35% <= 100 milliseconds
99.37% <= 101 milliseconds
99.41% <= 102 milliseconds
99.46% <= 103 milliseconds
99.52% <= 104 milliseconds
99.57% <= 105 milliseconds
99.62% <= 106 milliseconds
99.66% <= 107 milliseconds
99.69% <= 108 milliseconds
99.71% <= 109 milliseconds
99.74% <= 110 milliseconds
99.75% <= 111 milliseconds
99.77% <= 112 milliseconds
99.79% <= 113 milliseconds
99.80% <= 114 milliseconds
99.83% <= 115 milliseconds
99.85% <= 116 milliseconds
99.86% <= 117 milliseconds
99.90% <= 118 milliseconds
99.92% <= 119 milliseconds
99.94% <= 120 milliseconds
99.95% <= 121 milliseconds
99.96% <= 122 milliseconds
99.97% <= 123 milliseconds
99.97% <= 124 milliseconds
99.98% <= 125 milliseconds
99.98% <= 126 milliseconds
99.98% <= 127 milliseconds
99.99% <= 128 milliseconds
99.99% <= 129 milliseconds
99.99% <= 130 milliseconds
100.00% <= 131 milliseconds
100.00% <= 132 milliseconds
100.00% <= 133 milliseconds
100.00% <= 135 milliseconds
886.77 requests per second

====== GET ======
  100000 requests completed in 14.27 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.06% <= 1 milliseconds
0.80% <= 2 milliseconds
3.97% <= 3 milliseconds
15.05% <= 4 milliseconds
36.26% <= 5 milliseconds
54.44% <= 6 milliseconds
66.75% <= 7 milliseconds
76.00% <= 8 milliseconds
83.61% <= 9 milliseconds
88.67% <= 10 milliseconds
92.31% <= 11 milliseconds
94.63% <= 12 milliseconds
96.11% <= 13 milliseconds
97.18% <= 14 milliseconds
97.77% <= 15 milliseconds
98.36% <= 16 milliseconds
98.72% <= 17 milliseconds
98.96% <= 18 milliseconds
99.14% <= 19 milliseconds
99.23% <= 20 milliseconds
99.32% <= 21 milliseconds
99.40% <= 22 milliseconds
99.46% <= 23 milliseconds
99.52% <= 24 milliseconds
99.59% <= 25 milliseconds
99.62% <= 26 milliseconds
99.68% <= 27 milliseconds
99.71% <= 28 milliseconds
99.76% <= 29 milliseconds
99.81% <= 30 milliseconds
99.83% <= 31 milliseconds
99.85% <= 32 milliseconds
99.87% <= 33 milliseconds
99.88% <= 34 milliseconds
99.89% <= 35 milliseconds
99.89% <= 36 milliseconds
99.90% <= 38 milliseconds
99.90% <= 39 milliseconds
99.90% <= 43 milliseconds
99.91% <= 44 milliseconds
99.92% <= 45 milliseconds
99.92% <= 46 milliseconds
99.94% <= 47 milliseconds
99.96% <= 48 milliseconds
99.97% <= 60 milliseconds
99.98% <= 61 milliseconds
99.99% <= 62 milliseconds
100.00% <= 63 milliseconds
100.00% <= 64 milliseconds
100.00% <= 65 milliseconds
100.00% <= 65 milliseconds
7,007.22 requests per second

====== INCR ======
  100000 requests completed in 114.58 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.01% <= 3 milliseconds
0.05% <= 4 milliseconds
0.09% <= 5 milliseconds
0.14% <= 6 milliseconds
0.18% <= 7 milliseconds
0.20% <= 8 milliseconds
0.23% <= 9 milliseconds
0.23% <= 10 milliseconds
0.24% <= 11 milliseconds
0.25% <= 12 milliseconds
0.25% <= 13 milliseconds
0.25% <= 14 milliseconds
0.25% <= 15 milliseconds
0.26% <= 16 milliseconds
0.26% <= 17 milliseconds
0.26% <= 18 milliseconds
0.27% <= 19 milliseconds
0.27% <= 20 milliseconds
0.27% <= 21 milliseconds
0.27% <= 22 milliseconds
0.27% <= 23 milliseconds
0.28% <= 24 milliseconds
0.28% <= 25 milliseconds
0.28% <= 26 milliseconds
0.29% <= 27 milliseconds
0.29% <= 28 milliseconds
0.29% <= 29 milliseconds
0.29% <= 30 milliseconds
0.29% <= 31 milliseconds
0.30% <= 32 milliseconds
0.30% <= 33 milliseconds
0.31% <= 34 milliseconds
0.31% <= 35 milliseconds
0.31% <= 36 milliseconds
0.31% <= 37 milliseconds
0.31% <= 38 milliseconds
0.32% <= 39 milliseconds
0.32% <= 40 milliseconds
0.32% <= 41 milliseconds
0.33% <= 42 milliseconds
0.33% <= 43 milliseconds
0.34% <= 44 milliseconds
0.35% <= 45 milliseconds
0.36% <= 46 milliseconds
0.39% <= 47 milliseconds
0.64% <= 48 milliseconds
1.67% <= 49 milliseconds
4.73% <= 50 milliseconds
10.10% <= 51 milliseconds
18.02% <= 52 milliseconds
27.31% <= 53 milliseconds
37.43% <= 54 milliseconds
47.33% <= 55 milliseconds
55.74% <= 56 milliseconds
62.58% <= 57 milliseconds
68.33% <= 58 milliseconds
72.86% <= 59 milliseconds
76.59% <= 60 milliseconds
79.71% <= 61 milliseconds
82.26% <= 62 milliseconds
84.54% <= 63 milliseconds
86.51% <= 64 milliseconds
88.25% <= 65 milliseconds
89.83% <= 66 milliseconds
91.30% <= 67 milliseconds
92.53% <= 68 milliseconds
93.53% <= 69 milliseconds
94.53% <= 70 milliseconds
95.32% <= 71 milliseconds
95.99% <= 72 milliseconds
96.51% <= 73 milliseconds
96.91% <= 74 milliseconds
97.22% <= 75 milliseconds
97.50% <= 76 milliseconds
97.74% <= 77 milliseconds
97.95% <= 78 milliseconds
98.14% <= 79 milliseconds
98.31% <= 80 milliseconds
98.46% <= 81 milliseconds
98.57% <= 82 milliseconds
98.67% <= 83 milliseconds
98.76% <= 84 milliseconds
98.80% <= 85 milliseconds
98.84% <= 86 milliseconds
98.87% <= 87 milliseconds
98.91% <= 88 milliseconds
98.95% <= 89 milliseconds
98.98% <= 90 milliseconds
99.04% <= 91 milliseconds
99.09% <= 92 milliseconds
99.15% <= 93 milliseconds
99.19% <= 94 milliseconds
99.24% <= 95 milliseconds
99.29% <= 96 milliseconds
99.33% <= 97 milliseconds
99.36% <= 98 milliseconds
99.39% <= 99 milliseconds
99.42% <= 100 milliseconds
99.45% <= 101 milliseconds
99.47% <= 102 milliseconds
99.49% <= 103 milliseconds
99.50% <= 104 milliseconds
99.54% <= 105 milliseconds
99.58% <= 106 milliseconds
99.63% <= 107 milliseconds
99.70% <= 108 milliseconds
99.73% <= 109 milliseconds
99.76% <= 110 milliseconds
99.80% <= 111 milliseconds
99.81% <= 112 milliseconds
99.84% <= 113 milliseconds
99.84% <= 114 milliseconds
99.86% <= 115 milliseconds
99.87% <= 116 milliseconds
99.88% <= 117 milliseconds
99.89% <= 118 milliseconds
99.90% <= 119 milliseconds
99.91% <= 120 milliseconds
99.92% <= 121 milliseconds
99.94% <= 122 milliseconds
99.94% <= 123 milliseconds
99.96% <= 124 milliseconds
99.97% <= 125 milliseconds
99.98% <= 126 milliseconds
99.98% <= 127 milliseconds
99.98% <= 129 milliseconds
99.98% <= 130 milliseconds
99.99% <= 131 milliseconds
99.99% <= 132 milliseconds
99.99% <= 133 milliseconds
100.00% <= 135 milliseconds
100.00% <= 136 milliseconds
100.00% <= 137 milliseconds
100.00% <= 139 milliseconds
872.73 requests per second

====== LPUSH ======
  100000 requests completed in 6.16 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

12.31% <= 1 milliseconds
65.83% <= 2 milliseconds
90.48% <= 3 milliseconds
95.51% <= 4 milliseconds
97.28% <= 5 milliseconds
98.57% <= 6 milliseconds
99.15% <= 7 milliseconds
99.51% <= 8 milliseconds
99.75% <= 9 milliseconds
99.84% <= 10 milliseconds
99.85% <= 11 milliseconds
99.91% <= 12 milliseconds
99.95% <= 13 milliseconds
99.97% <= 14 milliseconds
100.00% <= 15 milliseconds
16,225.86 requests per second

====== RPUSH ======
  100000 requests completed in 5.98 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

13.67% <= 1 milliseconds
67.88% <= 2 milliseconds
91.35% <= 3 milliseconds
95.88% <= 4 milliseconds
97.76% <= 5 milliseconds
98.74% <= 6 milliseconds
99.40% <= 7 milliseconds
99.82% <= 8 milliseconds
99.89% <= 9 milliseconds
99.92% <= 10 milliseconds
99.93% <= 11 milliseconds
99.94% <= 12 milliseconds
99.96% <= 13 milliseconds
99.98% <= 20 milliseconds
99.98% <= 21 milliseconds
99.99% <= 22 milliseconds
100.00% <= 22 milliseconds
16,716.82 requests per second

====== LPOP ======
  100000 requests completed in 5.99 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

16.44% <= 1 milliseconds
68.34% <= 2 milliseconds
90.42% <= 3 milliseconds
95.37% <= 4 milliseconds
97.40% <= 5 milliseconds
98.41% <= 6 milliseconds
99.01% <= 7 milliseconds
99.49% <= 8 milliseconds
99.64% <= 9 milliseconds
99.74% <= 10 milliseconds
99.74% <= 11 milliseconds
99.78% <= 12 milliseconds
99.81% <= 13 milliseconds
99.86% <= 14 milliseconds
99.88% <= 15 milliseconds
99.88% <= 19 milliseconds
99.88% <= 31 milliseconds
99.90% <= 32 milliseconds
99.93% <= 35 milliseconds
99.94% <= 36 milliseconds
99.96% <= 41 milliseconds
99.98% <= 42 milliseconds
100.00% <= 43 milliseconds
100.00% <= 43 milliseconds
16,680.57 requests per second

====== RPOP ======
  100000 requests completed in 5.78 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

18.37% <= 1 milliseconds
66.65% <= 2 milliseconds
89.75% <= 3 milliseconds
95.72% <= 4 milliseconds
97.57% <= 5 milliseconds
98.68% <= 6 milliseconds
99.29% <= 7 milliseconds
99.61% <= 8 milliseconds
99.76% <= 9 milliseconds
99.81% <= 10 milliseconds
99.86% <= 11 milliseconds
99.90% <= 12 milliseconds
99.90% <= 13 milliseconds
99.91% <= 14 milliseconds
99.92% <= 15 milliseconds
99.92% <= 16 milliseconds
99.93% <= 17 milliseconds
99.95% <= 18 milliseconds
99.97% <= 19 milliseconds
100.00% <= 22 milliseconds
100.00% <= 22 milliseconds
17,295.05 requests per second

====== SADD ======
  100000 requests completed in 121.21 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 2 milliseconds
0.00% <= 3 milliseconds
0.03% <= 4 milliseconds
0.05% <= 5 milliseconds
0.07% <= 6 milliseconds
0.09% <= 7 milliseconds
0.12% <= 8 milliseconds
0.14% <= 9 milliseconds
0.16% <= 10 milliseconds
0.18% <= 11 milliseconds
0.20% <= 12 milliseconds
0.21% <= 13 milliseconds
0.22% <= 14 milliseconds
0.24% <= 15 milliseconds
0.26% <= 16 milliseconds
0.27% <= 17 milliseconds
0.27% <= 18 milliseconds
0.28% <= 19 milliseconds
0.30% <= 20 milliseconds
0.31% <= 21 milliseconds
0.33% <= 22 milliseconds
0.34% <= 23 milliseconds
0.35% <= 24 milliseconds
0.36% <= 25 milliseconds
0.37% <= 26 milliseconds
0.38% <= 27 milliseconds
0.39% <= 28 milliseconds
0.39% <= 29 milliseconds
0.40% <= 30 milliseconds
0.41% <= 31 milliseconds
0.42% <= 32 milliseconds
0.43% <= 33 milliseconds
0.43% <= 34 milliseconds
0.44% <= 35 milliseconds
0.45% <= 36 milliseconds
0.46% <= 37 milliseconds
0.47% <= 38 milliseconds
0.48% <= 39 milliseconds
0.49% <= 40 milliseconds
0.50% <= 41 milliseconds
0.50% <= 42 milliseconds
0.51% <= 43 milliseconds
0.52% <= 44 milliseconds
0.53% <= 45 milliseconds
0.53% <= 46 milliseconds
0.54% <= 47 milliseconds
0.55% <= 48 milliseconds
0.57% <= 49 milliseconds
0.72% <= 50 milliseconds
1.49% <= 51 milliseconds
3.58% <= 52 milliseconds
8.02% <= 53 milliseconds
15.57% <= 54 milliseconds
24.98% <= 55 milliseconds
34.61% <= 56 milliseconds
43.61% <= 57 milliseconds
51.11% <= 58 milliseconds
57.36% <= 59 milliseconds
62.58% <= 60 milliseconds
67.11% <= 61 milliseconds
71.08% <= 62 milliseconds
74.62% <= 63 milliseconds
77.62% <= 64 milliseconds
80.08% <= 65 milliseconds
82.02% <= 66 milliseconds
83.85% <= 67 milliseconds
85.43% <= 68 milliseconds
86.93% <= 69 milliseconds
88.25% <= 70 milliseconds
89.36% <= 71 milliseconds
90.50% <= 72 milliseconds
91.51% <= 73 milliseconds
92.50% <= 74 milliseconds
93.36% <= 75 milliseconds
94.16% <= 76 milliseconds
94.78% <= 77 milliseconds
95.40% <= 78 milliseconds
95.89% <= 79 milliseconds
96.27% <= 80 milliseconds
96.61% <= 81 milliseconds
96.98% <= 82 milliseconds
97.26% <= 83 milliseconds
97.46% <= 84 milliseconds
97.60% <= 85 milliseconds
97.77% <= 86 milliseconds
97.93% <= 87 milliseconds
98.07% <= 88 milliseconds
98.19% <= 89 milliseconds
98.30% <= 90 milliseconds
98.39% <= 91 milliseconds
98.48% <= 92 milliseconds
98.57% <= 93 milliseconds
98.64% <= 94 milliseconds
98.68% <= 95 milliseconds
98.74% <= 96 milliseconds
98.80% <= 97 milliseconds
98.84% <= 98 milliseconds
98.89% <= 99 milliseconds
98.94% <= 100 milliseconds
98.98% <= 101 milliseconds
99.02% <= 102 milliseconds
99.06% <= 103 milliseconds
99.08% <= 104 milliseconds
99.13% <= 105 milliseconds
99.19% <= 106 milliseconds
99.23% <= 107 milliseconds
99.26% <= 108 milliseconds
99.31% <= 109 milliseconds
99.33% <= 110 milliseconds
99.35% <= 111 milliseconds
99.37% <= 112 milliseconds
99.40% <= 113 milliseconds
99.43% <= 114 milliseconds
99.46% <= 115 milliseconds
99.49% <= 116 milliseconds
99.51% <= 117 milliseconds
99.53% <= 118 milliseconds
99.54% <= 119 milliseconds
99.56% <= 120 milliseconds
99.57% <= 121 milliseconds
99.58% <= 122 milliseconds
99.60% <= 123 milliseconds
99.61% <= 124 milliseconds
99.62% <= 125 milliseconds
99.65% <= 126 milliseconds
99.67% <= 127 milliseconds
99.70% <= 128 milliseconds
99.73% <= 129 milliseconds
99.75% <= 130 milliseconds
99.75% <= 131 milliseconds
99.77% <= 132 milliseconds
99.78% <= 133 milliseconds
99.78% <= 134 milliseconds
99.79% <= 135 milliseconds
99.81% <= 136 milliseconds
99.82% <= 137 milliseconds
99.84% <= 138 milliseconds
99.85% <= 139 milliseconds
99.86% <= 140 milliseconds
99.86% <= 141 milliseconds
99.88% <= 142 milliseconds
99.89% <= 143 milliseconds
99.90% <= 144 milliseconds
99.92% <= 145 milliseconds
99.94% <= 146 milliseconds
99.94% <= 147 milliseconds
99.94% <= 148 milliseconds
99.94% <= 149 milliseconds
99.95% <= 151 milliseconds
99.95% <= 152 milliseconds
99.96% <= 153 milliseconds
99.96% <= 154 milliseconds
99.96% <= 155 milliseconds
99.97% <= 156 milliseconds
99.97% <= 157 milliseconds
99.97% <= 159 milliseconds
99.97% <= 160 milliseconds
99.97% <= 162 milliseconds
99.97% <= 164 milliseconds
99.97% <= 166 milliseconds
99.98% <= 167 milliseconds
99.98% <= 169 milliseconds
99.98% <= 170 milliseconds
99.98% <= 171 milliseconds
99.99% <= 172 milliseconds
99.99% <= 173 milliseconds
99.99% <= 175 milliseconds
100.00% <= 176 milliseconds
100.00% <= 186 milliseconds
100.00% <= 223 milliseconds
825.01 requests per second

====== HSET ======
  100000 requests completed in 115.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
0.00% <= 2 milliseconds
0.02% <= 3 milliseconds
0.07% <= 4 milliseconds
0.13% <= 5 milliseconds
0.21% <= 6 milliseconds
0.25% <= 7 milliseconds
0.27% <= 8 milliseconds
0.29% <= 9 milliseconds
0.30% <= 10 milliseconds
0.30% <= 11 milliseconds
0.31% <= 12 milliseconds
0.31% <= 13 milliseconds
0.31% <= 15 milliseconds
0.31% <= 16 milliseconds
0.32% <= 17 milliseconds
0.32% <= 18 milliseconds
0.32% <= 19 milliseconds
0.33% <= 20 milliseconds
0.33% <= 21 milliseconds
0.33% <= 22 milliseconds
0.34% <= 23 milliseconds
0.34% <= 24 milliseconds
0.34% <= 25 milliseconds
0.34% <= 26 milliseconds
0.34% <= 28 milliseconds
0.35% <= 29 milliseconds
0.35% <= 30 milliseconds
0.35% <= 31 milliseconds
0.36% <= 32 milliseconds
0.36% <= 33 milliseconds
0.36% <= 34 milliseconds
0.37% <= 35 milliseconds
0.37% <= 36 milliseconds
0.38% <= 37 milliseconds
0.38% <= 38 milliseconds
0.38% <= 39 milliseconds
0.39% <= 40 milliseconds
0.39% <= 41 milliseconds
0.40% <= 42 milliseconds
0.41% <= 43 milliseconds
0.42% <= 44 milliseconds
0.43% <= 45 milliseconds
0.44% <= 46 milliseconds
0.45% <= 47 milliseconds
0.49% <= 48 milliseconds
0.70% <= 49 milliseconds
1.78% <= 50 milliseconds
4.83% <= 51 milliseconds
10.58% <= 52 milliseconds
18.29% <= 53 milliseconds
28.02% <= 54 milliseconds
38.07% <= 55 milliseconds
48.07% <= 56 milliseconds
57.04% <= 57 milliseconds
64.24% <= 58 milliseconds
70.60% <= 59 milliseconds
75.68% <= 60 milliseconds
80.00% <= 61 milliseconds
83.25% <= 62 milliseconds
85.70% <= 63 milliseconds
87.67% <= 64 milliseconds
89.21% <= 65 milliseconds
90.56% <= 66 milliseconds
91.75% <= 67 milliseconds
92.78% <= 68 milliseconds
93.65% <= 69 milliseconds
94.39% <= 70 milliseconds
95.04% <= 71 milliseconds
95.59% <= 72 milliseconds
96.10% <= 73 milliseconds
96.45% <= 74 milliseconds
96.76% <= 75 milliseconds
97.06% <= 76 milliseconds
97.35% <= 77 milliseconds
97.59% <= 78 milliseconds
97.81% <= 79 milliseconds
98.01% <= 80 milliseconds
98.17% <= 81 milliseconds
98.30% <= 82 milliseconds
98.39% <= 83 milliseconds
98.50% <= 84 milliseconds
98.61% <= 85 milliseconds
98.70% <= 86 milliseconds
98.79% <= 87 milliseconds
98.84% <= 88 milliseconds
98.89% <= 89 milliseconds
98.94% <= 90 milliseconds
98.99% <= 91 milliseconds
99.03% <= 92 milliseconds
99.07% <= 93 milliseconds
99.10% <= 94 milliseconds
99.14% <= 95 milliseconds
99.18% <= 96 milliseconds
99.21% <= 97 milliseconds
99.24% <= 98 milliseconds
99.27% <= 99 milliseconds
99.32% <= 100 milliseconds
99.36% <= 101 milliseconds
99.41% <= 102 milliseconds
99.45% <= 103 milliseconds
99.47% <= 104 milliseconds
99.50% <= 105 milliseconds
99.54% <= 106 milliseconds
99.56% <= 107 milliseconds
99.59% <= 108 milliseconds
99.61% <= 109 milliseconds
99.63% <= 110 milliseconds
99.65% <= 111 milliseconds
99.68% <= 112 milliseconds
99.70% <= 113 milliseconds
99.72% <= 114 milliseconds
99.75% <= 115 milliseconds
99.76% <= 116 milliseconds
99.78% <= 117 milliseconds
99.79% <= 118 milliseconds
99.80% <= 119 milliseconds
99.80% <= 120 milliseconds
99.81% <= 121 milliseconds
99.82% <= 122 milliseconds
99.83% <= 123 milliseconds
99.84% <= 124 milliseconds
99.86% <= 125 milliseconds
99.87% <= 126 milliseconds
99.88% <= 127 milliseconds
99.89% <= 128 milliseconds
99.89% <= 129 milliseconds
99.89% <= 130 milliseconds
99.90% <= 131 milliseconds
99.90% <= 132 milliseconds
99.91% <= 133 milliseconds
99.93% <= 134 milliseconds
99.94% <= 135 milliseconds
99.95% <= 136 milliseconds
99.96% <= 137 milliseconds
99.97% <= 138 milliseconds
99.97% <= 139 milliseconds
99.97% <= 140 milliseconds
99.97% <= 141 milliseconds
99.97% <= 143 milliseconds
99.98% <= 144 milliseconds
99.98% <= 145 milliseconds
99.98% <= 146 milliseconds
99.99% <= 147 milliseconds
99.99% <= 148 milliseconds
99.99% <= 149 milliseconds
99.99% <= 150 milliseconds
100.00% <= 151 milliseconds
100.00% <= 152 milliseconds
100.00% <= 153 milliseconds
862.66 requests per second

====== SPOP ======
  100000 requests completed in 6.14 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

15.90% <= 1 milliseconds
65.82% <= 2 milliseconds
89.10% <= 3 milliseconds
94.65% <= 4 milliseconds
97.01% <= 5 milliseconds
98.21% <= 6 milliseconds
99.00% <= 7 milliseconds
99.49% <= 8 milliseconds
99.61% <= 9 milliseconds
99.70% <= 10 milliseconds
99.78% <= 11 milliseconds
99.86% <= 12 milliseconds
99.89% <= 13 milliseconds
99.89% <= 14 milliseconds
99.91% <= 15 milliseconds
99.95% <= 17 milliseconds
99.95% <= 34 milliseconds
99.97% <= 35 milliseconds
100.00% <= 36 milliseconds
100.00% <= 37 milliseconds
100.00% <= 37 milliseconds
16,299.92 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 6.17 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

15.12% <= 1 milliseconds
65.16% <= 2 milliseconds
89.62% <= 3 milliseconds
95.11% <= 4 milliseconds
97.26% <= 5 milliseconds
98.29% <= 6 milliseconds
98.96% <= 7 milliseconds
99.26% <= 8 milliseconds
99.42% <= 9 milliseconds
99.53% <= 10 milliseconds
99.59% <= 11 milliseconds
99.68% <= 12 milliseconds
99.72% <= 13 milliseconds
99.87% <= 14 milliseconds
99.89% <= 15 milliseconds
99.93% <= 16 milliseconds
99.97% <= 17 milliseconds
99.98% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 19 milliseconds
16,212.71 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 6.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

13.69% <= 1 milliseconds
67.04% <= 2 milliseconds
90.46% <= 3 milliseconds
95.56% <= 4 milliseconds
97.49% <= 5 milliseconds
98.37% <= 6 milliseconds
99.16% <= 7 milliseconds
99.58% <= 8 milliseconds
99.74% <= 9 milliseconds
99.81% <= 10 milliseconds
99.87% <= 11 milliseconds
99.91% <= 12 milliseconds
99.93% <= 13 milliseconds
99.96% <= 15 milliseconds
99.97% <= 16 milliseconds
99.97% <= 21 milliseconds
99.97% <= 38 milliseconds
99.99% <= 41 milliseconds
100.00% <= 41 milliseconds
15,974.44 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.93 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

17.84% <= 1 milliseconds
66.35% <= 2 milliseconds
89.75% <= 3 milliseconds
95.37% <= 4 milliseconds
97.68% <= 5 milliseconds
98.64% <= 6 milliseconds
99.21% <= 7 milliseconds
99.59% <= 8 milliseconds
99.74% <= 9 milliseconds
99.82% <= 10 milliseconds
99.86% <= 11 milliseconds
99.91% <= 12 milliseconds
99.96% <= 13 milliseconds
99.96% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 15 milliseconds
16,874.79 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 6.18 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

14.56% <= 1 milliseconds
65.55% <= 2 milliseconds
89.85% <= 3 milliseconds
95.22% <= 4 milliseconds
97.29% <= 5 milliseconds
98.31% <= 6 milliseconds
98.97% <= 7 milliseconds
99.33% <= 8 milliseconds
99.52% <= 9 milliseconds
99.69% <= 10 milliseconds
99.79% <= 11 milliseconds
99.84% <= 12 milliseconds
99.91% <= 13 milliseconds
99.96% <= 14 milliseconds
99.98% <= 15 milliseconds
100.00% <= 16 milliseconds
16,170.76 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 6.34 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

13.68% <= 1 milliseconds
65.18% <= 2 milliseconds
88.87% <= 3 milliseconds
94.38% <= 4 milliseconds
96.77% <= 5 milliseconds
97.95% <= 6 milliseconds
98.77% <= 7 milliseconds
99.28% <= 8 milliseconds
99.47% <= 9 milliseconds
99.58% <= 10 milliseconds
99.67% <= 11 milliseconds
99.69% <= 12 milliseconds
99.77% <= 13 milliseconds
99.81% <= 14 milliseconds
99.83% <= 15 milliseconds
99.86% <= 16 milliseconds
99.87% <= 17 milliseconds
99.88% <= 19 milliseconds
99.89% <= 20 milliseconds
99.89% <= 21 milliseconds
99.90% <= 22 milliseconds
99.91% <= 23 milliseconds
99.91% <= 27 milliseconds
99.91% <= 29 milliseconds
99.91% <= 36 milliseconds
99.93% <= 37 milliseconds
99.98% <= 38 milliseconds
99.98% <= 39 milliseconds
100.00% <= 39 milliseconds
15,780.34 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 6.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

12.91% <= 1 milliseconds
61.49% <= 2 milliseconds
89.16% <= 3 milliseconds
94.95% <= 4 milliseconds
97.40% <= 5 milliseconds
98.46% <= 6 milliseconds
99.18% <= 7 milliseconds
99.55% <= 8 milliseconds
99.65% <= 9 milliseconds
99.74% <= 10 milliseconds
99.80% <= 11 milliseconds
99.83% <= 12 milliseconds
99.84% <= 13 milliseconds
99.89% <= 14 milliseconds
99.92% <= 15 milliseconds
99.98% <= 16 milliseconds
100.00% <= 17 milliseconds
15,890.67 requests per second